Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC01/atdf/PIC32CK2051GC01064.atdf
        <register name="CFG" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Configuration">
          <bitfield name="DCCDMALEVEL0" caption="DMA Trigger 0 Level" mask="0x1" values="CFG__DCCDMALEVEL"/>
          <bitfield name="DCCDMALEVEL1" caption="DMA Trigger 1 Level" mask="0x2" values="CFG__DCCDMALEVEL"/>
          <bitfield name="MBFI" caption="Enables the Memory Bist Fault Injection" mask="0x4"/>
          <bitfield name="MISC" caption="Device Specific Configuration Register" mask="0xFFFFFF00"/>
        </register>
        <register name="MBFI0" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Memory Bist Fault Injection 0">
          <bitfield name="BIDX" caption="Bit Index of injected fault" mask="0x1F"/>
          <bitfield name="AMMOD" caption="Address matching mode" mask="0x40" values="MBFI0__AMMOD"/>
          <bitfield name="FTYPE" caption="Fault type" mask="0x80" values="MBFI0__FTYPE"/>
          <bitfield name="AMMSK" caption="Address matching Mask (Word address)" mask="0xFFFFFF00"/>
        </register>
        <register name="MBFI1" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="Memory Bist Fault Injection 1">
          <bitfield name="ADDR" caption="Word Address" mask="0xFFFFFFFC"/>
        </register>
        <register name="STATUSA" offset="0x100" rw="RW" size="4" initval="0x00000000" caption="Status A">
          <bitfield name="DONE" caption="Done" mask="0x1"/>
          <bitfield name="FAIL" caption="Failure" mask="0x2"/>
          <bitfield name="BERR" caption="Bus Error" mask="0x4"/>
          <bitfield name="PERR" caption="Protection Error" mask="0x8"/>
          <bitfield name="CRSTEXT0" caption="CPU 0 Reset Phase Extension" mask="0x100"/>
          <bitfield name="CRSTEXT1" caption="CPU 1 Reset Phase Extension" mask="0x200"/>
          <bitfield name="CRSTEXT2" caption="CPU 2 Reset Phase Extension" mask="0x400"/>
          <bitfield name="CRSTEXT3" caption="CPU 3 Reset Phase Extension" mask="0x800"/>
          <bitfield name="BREXT0" caption="BootRom 0 Phase Extension" mask="0x10000"/>
          <bitfield name="BREXT1" caption="BootRom 1 Phase Extension" mask="0x20000"/>
          <bitfield name="BREXT2" caption="BootRom 2 Phase Extension" mask="0x40000"/>
          <bitfield name="BREXT3" caption="BootRom 3 Phase Extension" mask="0x80000"/>
        </register>
        <register name="STATUSB" offset="0x104" rw="R" size="4" initval="0x00000000" caption="Status B">
          <bitfield name="BCCD0" caption="Boot ROM Communication Channel 0 Dirty" mask="0x1"/>
          <bitfield name="BCCD1" caption="Boot ROM Communication Channel 1 Dirty" mask="0x2"/>
          <bitfield name="DCCD0" caption="Debug Communication Channel 0 Dirty" mask="0x4"/>
          <bitfield name="DCCD1" caption="Debug Communication Channel 1 Dirty" mask="0x8"/>
          <bitfield name="DBGPRES" caption="Debugger Present" mask="0x100"/>
          <bitfield name="HPE" caption="Hot-Plugging Enable" mask="0x400"/>
          <bitfield name="APDIS" caption="ARM Access Ports Disabled" mask="0x800"/>
        </register>
        <register name="STATUSC" offset="0x108" rw="R" size="4" initval="0x00000000" caption="Status C">
          <bitfield name="STATE" caption="Core State" mask="0x1F" values="STATUSC__STATE"/>
          <bitfield name="INDEX" caption="MBIST, MSA, PMSA bit Index" mask="0x1F00"/>
        </register>
        <register name="BCC" offset="0x110" rw="RW" size="4" count="2" initval="0x00000000" caption="Boot ROM Communication Channel x">
          <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="DCC" offset="0x118" rw="RW" size="4" count="2" initval="0x00000000" caption="Debug Communication Channel x">
          <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="DID" offset="0x120" rw="R" size="4" initval="0x09501053" caption="Device Identification">
          <bitfield name="MARKER" caption="Marker Bit" mask="0x1"/>
          <bitfield name="MANID" caption="Manufacturer ID" mask="0xFFE"/>
          <bitfield name="DEVSEL" caption="Device Select" mask="0xFF000"/>
          <bitfield name="PRODUCT" caption="Product" mask="0xFF00000"/>
          <bitfield name="REVISION" caption="Revision" mask="0xF0000000"/>
        </register>
        <register name="DAL" offset="0x124" rw="R" size="4" initval="0x00000000" caption="Debugger Access Level">
          <bitfield name="CPU0" caption="Per CPU Debugger Access Level" mask="0x3" values="DAL__CPU"/>
          <bitfield name="CPU1" caption="Per CPU Debugger Access Level" mask="0xC" values="DAL__CPU"/>
          <bitfield name="CPU2" caption="Per CPU Debugger Access Level" mask="0x30" values="DAL__CPU"/>
          <bitfield name="CPU3" caption="Per CPU Debugger Access Level" mask="0xC0" values="DAL__CPU"/>
        </register>
        <register name="ENTRY" offset="0x1000" rw="R" size="4" count="8" initval="0x00000000" caption="Coresight ROM Table Entry x">
          <bitfield name="EPRES" caption="Entry Present" mask="0x1"/>
          <bitfield name="FMT" caption="Format" mask="0x2"/>
          <bitfield name="ADDOFF" caption="Address Offset" mask="0xFFFFF000"/>
        </register>
        <register name="MEMTYPE" offset="0x1FCC" rw="R" size="4" initval="0x00000000" caption="Coresight ROM Table Memory Type">
          <bitfield name="SMEMP" caption="System Memory Present" mask="0x1"/>
        </register>
        <register name="PID4" offset="0x1FD0" rw="R" size="4" initval="0x00000000" caption="Coresight ROM Table Peripheral Identification 4">
          <bitfield name="JEPCC" caption="JEP-106 Continuation Code" mask="0xF"/>
          <bitfield name="FKBC" caption="4KB count" mask="0xF0"/>
        </register>
        <register name="PID5" offset="0x1FD4" rw="R" size="4" initval="0x00000000" caption="Coresight ROM Table Peripheral Identification 5">
        </register>
        <register name="PID6" offset="0x1FD8" rw="R" size="4" initval="0x00000000" caption="Coresight ROM Table Peripheral Identification 6">
        </register>
        <register name="PID7" offset="0x1FDC" rw="R" size="4" initval="0x00000000" caption="Coresight ROM Table Peripheral Identification 7">
        </register>
        <register name="PID0" offset="0x1FE0" rw="R" size="4" initval="0x000000D0" caption="Coresight ROM Table Peripheral Identification 0">
          <bitfield name="PARTNBL" caption="Part Number Low" mask="0xFF"/>
        </register>
        <register name="PID1" offset="0x1FE4" rw="R" size="4" initval="0x0000009C" caption="Coresight ROM Table Peripheral Identification 1">
          <bitfield name="PARTNBH" caption="Part Number High" mask="0xF"/>
          <bitfield name="JEPIDCL" caption="Low part of the JEP-106 Identity Code" mask="0xF0"/>
        </register>
        <register name="PID2" offset="0x1FE8" rw="R" size="4" initval="0x0000002A" caption="Coresight ROM Table Peripheral Identification 2">
          <bitfield name="JEPIDCH" caption="JEP-106 Identity Code High" mask="0x7"/>
          <bitfield name="JEPU" caption="JEP-106 Identity Code is used" mask="0x8"/>
          <bitfield name="REVISION" caption="Revision Number" mask="0xF0"/>
        </register>
        <register name="PID3" offset="0x1FEC" rw="R" size="4" initval="0x00000000" caption="Coresight ROM Table Peripheral Identification 3">
          <bitfield name="CUSMOD" caption="ARM CUSMOD" mask="0xF"/>
          <bitfield name="REVAND" caption="Revision Number" mask="0xF0"/>
        </register>
        <register name="CID0" offset="0x1FF0" rw="R" size="4" initval="0x0000000D" caption="Coresight ROM Table Component Identification 0">
          <bitfield name="PREAMBLEB0" caption="Preamble Byte 0" mask="0xFF"/>
        </register>
